Repository: giellalt/corpus-sme
Catalog: tmx/nob/admin/sd/reports_no/norutrapport_2012_6_samisk.pdf.tmx
Source language: sme
Languages: nob

source: birrasii 3‐4 olbmo, ja muhtun báikkiin maid olles 10 olbmo.
nob: Antallet intervjuer på hvert sted kan derfor variere fra 3‐4 til opp mot 10.

source: Váldoinformánttaid jearahallan lea bistán gaskal 1‐1 ž diimmu, ja leat miha oanehit áiggi geavahan hupmat singuin geain ii leat nu guovddáš doaibma.
nob: Intervjuene med nøkkelinformanter har vart fra 1‐1 ž time, mens mindre sentrale informanter har snakket med oss noe kortere tid.

source: Moaddása leat jearahallan telefuvnnas, go eai lean báikkis dalle go mii finadeimmet doppe.
nob: Et par av intervjuene er foretatt over telefon da informanten ikke var til stede under vårt besøk.

source: Eanas jearahallamat leat báddejuvvon ja maŋŋil čállojuvvon vai dutkit daid besset geavahit.
nob: De fleste intervjuene er tatt opp på bånd og senere skrevet ut for bruk av forskerne.

source: Mii leat válljen dan vuoigi ahte áibbas unnán čállit jur sánis sátnái maid min informánttat leat muitalan, ja eat ge geavat namaid, muhto geavahit gal virgenamahusa dahje posišuvnna nugo
nob: Vi har i svært begrenset grad valgt å sitere våre informanter, vi har heller ikke brukt navn, men ofte

source: beaivválaš jođiheaddji, stivrajođiheaddji, bargi, suohkaninformánta jnv..
nob: tittel eller posisjon som daglig leder, styreleder, ansatt, kommuneinformant osv..

source: Ollu dán raportta čohkkejuvvon dieđut leat ge huksejuvvon informánttaid persovnnalaš oainnuide, ja dilálašvuođaid ja doaimmaid ipmárdusaide.
nob: Mye av datamaterialet i denne rapporten er altså basert på informanters personlige syn og tolkninger av hendelser og aktiviteter.

source: Min mielas lea dehálaš diekkár dieđuid oažžut ovdan, ja maiddái oažžut ovdan áššiid maidda leat máŋggalágan oainnut. Dasa lassin árvvoštallat mii ieža olbmuid cealkámušaid ja čilgehusaid.
nob: Vi har sett det som viktig å formidle dette, men også få frem der det er ulike syn på samme sak, samt å gjøre egne vurderinger av utsagn og tolkninger.

source: Mii leat geahččalan doalahit dutkiid iežaset árvvoštallamiid digaštallanoassái, mii lea juohke giellaguovddáža kapihttala loahpas, ja maiddái loahppakapihttalis.
nob: Forskernes egne vurderinger er forsøkt holdt til drøftingsdelen til slutt i hvert språksenterkapittel, samt til det avsluttende kapittelet.

source: Mii leat maid jearahallan muhtumiid Sámedikki hálddahusdásis.
nob: Vi har også foretatt intervju med administrativt nivå på Sametinget.

source: Čuovvovaš kapihttaliin áigut mii geahččat dan logi sámi giellaguovddáža historihka ja doaimma.
nob: I de følgende kapitlene vil vi gå gjennom historikken og virksomheten til de ti samiske språksentrene.

source: Mii leat válljen juohke giellaguovddáža birra čállit sierra, ja dan mii dahkat kronologalaččat; dat guovddážat mat ovddemus lea ásahuvvon, daid birra čállit ovddemus, ja loahpas daid birra mat maŋemus leat ásahuvvon.
nob: Vi har valgt å presentere hvert språksenter for seg, og vi gjør dette kronologisk slik at de senterne som først ble etablert, blir gjennomgått først, mens de nyeste kommer til slutt. Vi har tatt utgangspunkt i en felles mal for hvordan disse data presenteres, men vektleggingen av de ulike

source: Mii leat ráhkadan oktasaš vuogi man mielde ovdanbuktit daid dieđuid maid leat čohkken, muhto guovddážis guovddážii sáhttet leat erohusat das maid leat válljen deattuhit, danin go eai buot oktavuođat leat nu áigeguovdilat dán árvvoštallamii, dahje gáibit seamma vuđolaš guorahallama.
nob: elementene kan være noe forskjellig fra senter til senter da ikke alle forhold er like relevante eller krever samme grundighet.

source: Maŋŋel dien čilgehusoasi, de geahččalit oktiigeassit dieđuid sierra kapihttalis, mas analyseret buot logi giellaguovddáža gávdnosiid ovttas.
nob: Etter denne gjennomgangen prøver vi å summere opp dataene i et kapittel hvor vi analyserer funnene på tvers av de ti språksentrene.

source: Das geahččalit geassit ovdan erohusaid ja dan mii lea seammalágan, oktasaš hástalusaid ja maiddái mii leat guđege guovddáža earenoamáš dovdomearka.
nob: Her prøver vi å trekke ut forskjeller og likheter, felles utfordringer og mer særegne trekk.

source: Ja das mii fas máhccat daid váttisvuođaid ovdandivvumiidda maid guoskkahalaimet álgokapihttalis, ja daid vuođul hábmet loahppaárvvoštallama.
nob: Vi vil ta fram igjen problemstillingene som ble løftet i innledningskapittelet, og konkludere i forhold til disse.

source: Loahpas buktit muhtun ávžžuhusaid mat gusket giellaguovddážiid doaimmaide viidáseappot ja earenoamážit dan dáfus movt Sámediggi ja eará berošteaddjit ja ruhtadeaddjit sáhttet bargat dan badjelii vai guovddážat olahit mearriduvvon mihttomeriid.
nob: Til slutt vil vi komme med noen anbefalinger om språksentrenes videre virksomhet og i særdeleshet hvordan Sametinget og andre interessenter og finansiører kan bidra til at målene for sentrene blir nådd.

source: 2 Sámi giella ‐ ja kulturguovddáš Porsáŋggus
nob: 2 Sámi giella ‐ ja kulturguovddáš ‐ Samisk språk‐ og kultursenteret i Porsanger

source: 2.1 Duogáš dasa manne giellaguovddáš ásahuvvui
nob: 2.1 Bakgrunn for opprettelsen av språksenteret

source: Porsáŋggu gielda Finnmárkku fylkkas lea Norgga vuosttaš almmolaš golmma ‐ kultuvrrat suohkan, gos gullo sihke dárogiella, sámegiella ja kveana / suomagiella.
nob: Porsanger kommune i Finnmark fylke er Norges første offisielle tre ‐ kulturelle kommune hvor både norsk, samisk og kvensk / finsk høres.

source: Porsáŋggu gielda lei okta dain guđa vuosttaš suohkaniin mat serve
nob: Deler av den samiske befolkningen i kommunen har røtter i

source: sámegiela hálddašanguvlui 1992:s.
nob: Porsanger kommune var en av de opprinnelig 6 kommunene som kom med i forvaltningsområdet for samisk språk i 1992.

source: Hálddašanguvlui dieđiheapmi dagahii veaháš soahpatmeahttunvuođaid iešguđetlágan berošteddjiid gaskii servodagas, lei vuolláičállinvuostálastin jnv., muhto gielddastivrras lei stuora eanetlohku mii oaivvildii dan ahte gielda galgá searvat.
nob: Innmeldelsen var preget av en del gnisninger mellom ulike interesser i samfunnet, underskriftskampanjer osv., men i kommunestyret var det et solid flertall for at kommunen skulle bli med.

source: Dan áiggi servodagas vuhttui ahte sámegiela dillái čuzii guhkes áiggi dáruiduhttin, ja ollu sápmelaččat ledje massán eatnigielas.
nob: Den samiske språksituasjonen var på dette tidspunktet preget av lang tids fornorskning, og mange av de med samiske røtter hadde mistet språket.

source: Liikka nagodii sámi morráneapmi maŋŋel Álttá ‐ stuimmiid rievdadit olbmuid oainnu sámegiela ektui, sihke sápmelaččaid gaskkas ja maiddái dáru álbmogis.
nob: etter blant annet Alta ‐ aksjonen et skifte i holdninger til det samiske både blant samer selv og den norsktalende befolkningen.

source: Gielddas ledje ge álggos hui stuora hástalusat, go galggai hukset alcces giellagelbbolašvuođa vai duođai nákce šaddat
nob: Kommunen stod derfor over en rekke utfordringer med å bygge opp egen språkkompetanse slik at kommunen kunne bli reelt tospråklig.

source: guovttegielalaš gieldan. Ja oalle árrat oidne ge ahte dat ii dáidde dáhpáhuvvat iešalddis, ja gieldda sámegiel konsuleanta lei leamaš Walesis ja oaidnán movt doppe barget nannet walesgiela nubbegiellaoahpahusa.
nob: Det ble tidlig klart at dette ikke ville komme av seg selv, og kommunens samiske språkkonsulent hadde vært i Wales og sett hvordan det ble jobbet for å styrke andrespråksopplæringen i walisisk.

source: Ja dasto bargagohte ge dan málle mielde, ja heivehedje dan Porsáŋggu dilálašvuođaide.
nob: Denne modellen ble det jobbet videre med, tilpasset forholdene i Porsanger.

source: Sii válde oktavuođa Sámi giellaráđiin, mii liikui sin jurddabohtosii ja dáhtui áinnas ruhtadit sámi giellaguovddáža geahččalanprošeaktan.
nob: Samisk språkråd ble kontaktet, likte ideen og var villig til å finansiere et prøveprosjekt med et samisk språksenter.

source: Porsáŋggu sámisearvi ja giellakonsuleanta ledje
nob: Porsanger sameforening og språkkonsulenten

source: njunnošis ovddideamen Porsáŋgui giella‐ ja kulturguovddáža, ja giellakonsuleanta lei ge guovddáža vuosttaš beaivválaš jođiheaddji.
nob: var den drivende kraft i utviklingen av Porsanger språk‐ og kultursenter, og språkkonsulenten ble den første daglige lederen.

source: Ásaheami dorjo politihkalaš bellodagat ja maiddái gieldda hálddahus.
nob: Etableringen hadde god støtte blant ulike partigrupperinger og administrasjonen i kommunen.

source: Die lei ge álgu vuosttaš sámi giellaguovddáža ásaheapmái Norggas, ja Gáivuonas čuovvoledje oalle johtilit seamma málle, ja nu maiddái eará suohkaniin sihke sámegiela hálddašanguovllus ja dan olggobealde.
nob: Dette ble begynnelsen på det første samiske språksenteret i Norge, og modellen ble raskt videreført til Kåfjord og etter hvert andre kommuner innafor og utafor språkforvaltningsområdet.

source: Giella ‐ ja kulturguovddáš ásahuvvui Levdnjii muhtun boares vistái mii ovdal lei leamaš
nob: Språk‐ og kultursenteret ble lokalisert i Lakselv til et eldre bygg som tidligere var skoleinternat. I dag

source: skuvlainternáhtta. Dál gohčodit dien vistti kurseguovddážin, ja dat lea mánáidskuvlla bálddas.
nob: går huset under betegnelsen kurssenteret, og ligger rett ved siden av barneskolen.

source: Latnjadilálašvuohta dagaha ahte ii leat vejolaš máŋga doaimma lágidit oktanaga, ferte earet eará lágidit duodjekurssiid ja biebmoráhkadankurssiid eará oahppolanjain.
nob: Lokalet har en del begrensninger i forhold til mulighet for å kjøre flere aktiviteter samtidig, bla må kurs innen duodji / sløyd og matlaging foregå i andre undervisningslokaler.

source: Lanjat gullet gildii, ja dat leat hui guovddážis dan dáfus ahte leat lahka skuvlla, muhto eai leat gal giliguovddážis oidnosis.
nob: Lokalene er kommunalt eid, og sentrale i forhold til skolen, men ikke så synlige i sentrumsbildet.

source: Guovddáža lahkosis eai leat eará sámi institušuvnnat.
nob: Senteret har ingen andre samiske institusjonen i sin nærhet.

source: Muhto suohkanis lea gal mearrasámi gelbbolašvuođaguovddáš, mii lea Siskkit Billavuonas.
nob: nærmere bestemt i bygda Indre Billefjord.

source: 2.2 Organiserenmálle válljen
nob: 2.2 Valg av organisasjonsform

source: Dalle go álggahišgohte Porsáŋggu giella ‐ ja kulturguovddáža, de árvvoštalle máŋggalágan organisatuvrralaš čovdosiid, sihke vuođđudusmálle ja oasussearvvi.
nob: Da Porsanger språk‐ og kultursenteret var under etablering, ble ulike organisatoriske løsninger diskutert, både stiftelse og aksjeselskap.

source: Muhto guovddáš šattai gildii gullevaš vuođđudus. Ledje earet eará rehkedollui guoskivaš teknihkalaš sivat dasa manne gávnnahedje álkimussan bidjat guovddáža gieldda vuollásaš doaibman.
nob: Det endte likevel som en kommunal stiftelse, og dette hadde blant annet regnskapstekniske årsaker som gjorde det praktisk å legge senteret under kommunen.

source: Guovddážii nammaduvvui sierra stivra maid gielddastivra vállje njealji jahkái ain hávális.
nob: Det ble etablert et eget styre oppnevnt av kommunestyret som ble valgt for fire år av

source: stivra, ja speadjalastá gielddastivrra politihkalaš ovttastumi.
nob: gangen. Styret er altså politisk oppnevnt, og gjenspeiler den politiske sammensetningen i kommunestyret.

source: Stivrras leat 5 lahtu, ja čállin lea gieldda giellakonsuleanta.
nob: Styret har vært på 5 personer, og sekretær er kommunens språkkonsulent.

source: Porsáŋggu gielddas lea virgáibidjanváldi ja bargoaddiovddasvástádus guovddáža bargiide, ja dat gullá gieldda hálddašanossodaga vuollái.
nob: Porsanger kommune har ansettelsesmyndighet og arbeidsgiveransvar overfor senterets ansatte, og det er underlagt administrasjonsavdelingen i kommunen.

source: Organiserenmálle lea leamaš rievddakeahttá álggaheami rájes, ja informánttaid mielas dat doaibmá bures.
nob: Organisasjonsformen har ligget fast helt siden opprettelsen, og informantene sier det har fungert greit.

source: Lea lagas fágalaš ja hálddahusdásis ovttasbargu gaskal guovddáža beaivválaš jođiheaddji ja gieldda giellakonsuleantta.
nob: Det er et nært faglig og administrativt samarbeid mellom senterets daglige leder og kommunens språkkonsulent.

source: Bargiin ja giellakonsuleanttas leat mánnosaččat fásta čoahkkimat hálddahushoavddain.
nob: De ansatte og språkkonsulenten har faste månedlige møter med administrasjonssjefen.

source: 2.3 Giella ‐ ja kulturguovddáža doaibma
nob: 2.3 Språk‐ og kultursenterets virksomhet

source: Dalle go guovddáš ásahuvvui 1994:s, de galge guovddážis leat golbma váldocakki mat dan doaimma galge doalahit badjin; ásahit giellabáikkiid mánáide ja nuoraide, doallat kurssiid gieldda bargiide ja
nob: Da senteret startet opp i 1994 var det tre hovedpilarer virksomheten ble bygget rundt; skape språkarenaer for barn og unge, kurse kommunalt ansatte, samt skape kulturforståelse i hele

source: bargat oažžut buoret kulturáddejumi olles álbmogii.
nob: befolkningen.

source: Giellaguovddáža ulbmilat leat čađat leamaš hui lahka dan višuvnna mii Porsáŋggu gielddas lea go dáhttu leat máŋggagielat ja máŋggakultuvrrat gielda, gos sámegielas lea lunddolaš sadji.
nob: Språksenterets målsetninger har vært sterkt knyttet opp mot kommunens visjon om Porsanger kommune som en flerspråklig og flerkulturell kommune hvor samisk er en naturlig del av dette.

source: Giellaguovddáš lea hui nannosit bargan dan badjelii ahte galgá nákcet fállat gildii giella ‐ ja kulturgelbbolašvuođa maid dat dárbbaša, ja man áigumuš lea ahte sámegielagat galget sáhttit váldit oktavuođa eatnigillii ja oažžut dan gilli veahki buot gieldda ossodagain.
nob: Språksenteret har hatt et stort fokus på å serve kommunens behov for språk‐ og kulturkompetanse, og hvor målet har vært at samiske brukere skal kunne henvende seg og bli betjent på sitt morsmål ved alle kommunens avdelinger.

source: Gieldda bargit ožžot virgelobi bálkkáin čuovvut sámegielkurssiid, ja jahkásaččat lágiduvvojit fáddábeaivvit guovddážis gos ossodagaide fállojuvvo kulturgelbbolašvuohta.
nob: Kommunalt ansatte skal få permisjon med lønn for å delta på språkkurs, og årlig arrangeres tematiske dag på senteret hvor de ulike avdelingene får tilbud i kulturkunnskap.

source: Gielda lea
nob: Kommunen har foretatt jevnlige kartlegginger av ansattes samisk ‐ kompetanse, og

source: jámma kárten bargiid sámegielmáhtu, ja dárbbut čállojujvvojit gieldda giellaplánii mii lea dehálaš reaidu go galget mearridit makkár doaimmat giellaguovddážis galget leat.
nob: behovene kanaliseres inn i den kommunale språkplanen som igjen er et viktig styringsinstrument for igangsetting av tiltak hos språksenterets.

source: Guovddáš lágida juohke jagi álgo ‐ ja joatkkakurssiid sámegielas dárogielat rávisolbmuide.
nob: Senteret har årlig kjørt samisk nybegynner‐ og videregående opplæring for norsktalende voksne.

source: Kursset leat lágiduvvon iešguđet dásis ja áiggi; álgokurse I‐ 130 diimmu, joatkkakurse II ‐ 80 d ja joatkkakurse III ‐ 84 d. «Álguš kurse lea lágiduvvon okte vahkus beaivet.
nob: Disse har gjerne vært delt opp i ulike bolker; nybegynnerkurs I‐ 130 t, videregående kurs II ‐ 80 t og videregående kurs III ‐ 84 t. Kurset «Algoš, og vært kjørt en dag i uka på dagtid.

source: Oasseválddit leat ožžon kurseduođaštusa, muhto sis ii leamaš gelbbolašvuohta čađahit eksámena mii addá lohkangelbbolašvuođa.
nob: Deltakerne har fått kursbevis, men har ikke hatt mulighet til å ta eksamen med kompetansegivende poeng.

source: Dasa lassin
nob: I tillegg er

source: leat sii lágidan hupman ‐ lohkan ‐ ja čállinkurssiid sámegielas rávisolbmuide geat máhttet veaháš sámegiela ovdalaččas ja áiggoše oahppat geavahit giela viššaleappot.
nob: det kjørt samisk tale‐ lese‐ og skrivekurs for voksne som kan en del fra før og vil bruke språket aktivt.

source: Dan kursses oahpahit giela muhtunlágan bargguid bokte.
nob: På dette kurset er språkopplæringen ofte blitt kombinert med andre aktiviteter.

source: Guovddáš lea vásihan ahte ii leat šat nu stuora beroštupmi dieid kurssiide.
nob: Senteret har opplevd at etterspørselen etter disse kursene har vært synkende.

source: Sámedikki 5‐jagi rávisolbmuidoahppoprográmma olis lea giellaguovddáš 2010 rájes lágidan guovttelágan kurssiid; čállinkursse sidjiide geain lea sámegiella eatnigiellan, ja SAAL ‐ kurse álgooahpahussan sidjiide geat eai máhte sámegiela.
nob: Innenfor Sametingets 5‐årige voksenopplæringsprogram har språksenteret fra 2010 gjennomført to typer kurs; skrivekurs i samisk for de som har samisk som morsmål, og SAAL ‐ kurs som begynneropplæring for ikke ‐ samisktalende.

source: SAAL ‐ kursset leat boahtán ovdalaš kurssiid
nob: SAAL ‐ kursene har erstattet de tidligere kursene, og skiller seg fra disse ved at de er

source: sadjái, ja leat earaláganat dan dáfus ahte dat addet gelbbolašvuođa.
nob: kompetansegivende.

source: Oasseválddiin ferte leat lohkangelbbolašvuohta ja sii galget dieđihit studeantan Sámi allaskuvlii vai ožžot oahppočuoggáid.
nob: Deltakerne må ha studiekompetanse og melde seg opp som studenter ved Samisk høgskole for å få de studiepoeng.

source: Lea leamaš stuora beroštupmi kurssiide mat addet gelbbolašvuođa, ja informánttaid mielas lea guhkes lávki ovddos go olbmuide addojuvvo vejolašvuohta čađahit eksámena.
nob: Interessen for de kompetansegivende kursene har vært stor, og informantene ser det som et stort fremskritt at det gis mulighet for å ta eksamen.

source: Formálalaččat galgá leat vejolaš álgit lohkat sámegiela lohkanbadjeoahppun Sámi allaskuvllas go lea čađahan SAAL II, muhto oasseválddit leat sávvan viidásit fálaldaga Porsáŋggus, danin go ballet ahte dáidá šaddat beare
nob: Formelt skal det være mulig å starte på semesteremne i samisk ved Samisk høgskole etter SAAL II, men deltakerne har ønsket et videre tilbud i Porsanger da spranget over til semesteremne kan bli for tøft. Kommuneinformanter trekker fram at flere kommunalt og statlig ansatte har bygget opp sin

source: váttis čuovvut lohkanbadjeoahpu. Gielddainformánttat muitalit ahte ollu bargit gieldda ja stáhta ásahusain leat huksen iežaset gelbbolašvuođa sámegielas cehkiid mielde go leat čuvvon kurssiid, ja sii buktet ge dan gelbbolašvuođa bargosadjái.
nob: samiskkompetanse steg for steg gjennom kursene, og tar denne med seg tilbake i arbeidet.

source: Leat giellaguovddáža bargit geat lágidit dieid kurssiid, ja sii geavahit ovdalaš kurssiid oahpponeavvuid.
nob: Kursene kjøres av språksentrets egne folk som bruker kompendier basert på tidligere kurs.

source: Daid lea Sámi allaskuvla, mii maid bagadallá oahpaheddjiid, dohkkehan oahpponeavvun.
nob: Disse er blitt godkjent som læremidler av Samisk høgskole som også veileder lærerne.

source: Leat válljen lágidit kurssiid intensiivakursen ovtta vahku mánus, beaivet, danin go diet málle heive buoremusat sidjiide geat galget oažžut virgelobi barggus.
nob: Det er valgt å kjøre kursene en uke intensivt på dagtid i måneden, da dette er det letteste å tilpasse i forhold til de som skal ha permisjon fra jobb.

source: Maŋemus jagiid lea guovddáš nannen doaimmaid mat leat mánáid ja nuoraid váste, ja 2010:s ráhkaduvvui sierra plána dien ulbmiljovkui.
nob: De siste årene har senteret styrket satsingen mot barn og unge, og i 2010 ble det laget en egen plan

source: Ovtta bargis leat ge mánát ja nuorat váldobargun.
nob: En av de ansatte har også barn og unge som sitt hovedområde.

source: Giellaguovddáš lea ráhkadan ollu fálaldagaid maid skuvllat ja mánáidgárddit sáhttet bidjat iežaset doaibmaplánaide.
nob: Språksenteret har utarbeidet en rekke tilbud som skoler og barnehager kan legge inn i sin virksomhetsplan.

source: Dat leat dakkár doaimmat nugo musihkka, lávlun‐ ja muitalusbottut, málesteapmi ja duddjon.
nob: Dette har vært tiltak som musikk, sang‐ og eventyrstund, matlaging og duodji.

source: Oassi diein doaimmain lágiduvvojit árbedieđu oahpaheapmin boarrasit buolvvas nuorat buolvvaide.
nob: En del av dette har vært lagt opp som overføring av tradisjonell kunnskap fra eldre til yngre.

source: Guovddáš lea maid ráhkadan oahpponávdnasiid ráđđálaga skuvlla
nob: Senteret har også utarbeidet undervisningsmateriale i samarbeid med samisklærere på skolene.

source: sámegieloahpaheddjiiguin.
nob: kalenderen.

source: Sáhttá fuolastuvvat dan dihte go sámegielat mánáidlohku skuvllas njiedjá (2011:s lei 26 % sámegiella, muhto 2006 lohku lei 37 % ja giellaguovddáš hálidivččii ge váikkuhit dasa ahte ásahuvvoše arenat daid mánáide ja vikkašii movttiidahttit váhnemiid válljet sámegiela mánáidasaset.
nob: Det er bekymringsfullt at antallet barn med samisk i skolen går ned (i 2011 hadde 26 % samisk, mens tallet var 37 % i 2006), og språksenteret ønsker å bidra til å skape arenaer for disse barna og oppmuntre foreldre til å velge samisk for sine barn.

source: Earet eará lágiduvvo aktivitehtabeaivi mánáide ja váhnemiidda.
nob: Blant annet blir det arrangert aktivitetsdag for barn og foreldre.

source: Lágideamit mat leat muđui gielddaássit várás leat dakkárat go ovdamearkkadihte Sámi álbmotbeaivvi
nob: Av arrangementer som er rettet mot befolkningen generelt, kan nevnes gjennomføringen av Samefolkets dag og kulturmåneden hvor senteret har en rekke arrangement for barn, unge, og voksne.

source: lágideapmi ja kulturmánnu; goas guovddážis leat ollu lágideamit mánáide, nuoraide ja rávisolbmuide. Jámma lágidit maid giellakáfeja, juovlaloahpaheami vuorrasiidda, duodječájáhusaid ja bádjebargguid.
nob: verksted. Gjennomføring av slike aktiviteter byr på en del utfordringer med lokalene som ikke er tilpasset behov for større plass til duodji, og i alle år har det vært spilt inn ønsker om nye lokaler som kan brukes som et samisk hus.

source: Diekkár doaimmaid lágideamit leat hástaleaddjit danin go lanjat eai leat dan meare viidát ahte heivejit duddjomiidda, ja juohke jagi leat ovddidan sávaldaga ahte galggaše oažžut ođđa lanjaid mat sáhtáše šaddat sámi viessun.
nob: Kommunen har bedt språksenteret se på ulike løsningsforslag, men ser for seg at en slik større samlingsplass må være et helhetlig hus hvor også det kvenske / finske er en del.

source: Gielda lea bivdán giellaguovddáža smiehttat iešguđetlágan čovdosiid, muhto gieldda oaivila mielde diekkár stuorát čoahkkebáiki fertešii leat dakkár viessu gos maiddái
nob: Senteret har også jobbet med dokumentasjonsarbeid, og her kan nevnes et fellesprosjekt om samiske ord og termer med kommuner i Avjovare urfolksregion, bygget opp en utstilling med Mari

source: kveana / suomagieldoaimmat leat oassin.
nob: Boines priser, det er samlet inn samiske stedsnavn, og utarbeidet en årlige Porsangerkalenderen.

source: Giella ‐ ja kulturguovddáš bargá eanemusat Porsáŋggu gielddas.
nob: Språk‐ og kultursentret har konsentrert sin virksomhet til Porsanger kommune.

source: Vaikko ránnjásuohkaniin eai leat ge sierra giellakursset, de ii leamaš áigeguovdil lágidit kurssiid doppe.
nob: Selv om flere av nabokommunene ikke har eget språksenter, har det ikke vært aktuelt å kjøre kurs der.

source: suohkaniin kurseoasseválddit geat leat boahtán Levdnjii kursii, sihke Kárášjogas ja miehtá Fálesnuori, Hámmárfeasttas, Ávanuoris ja Nordkáhpas.
nob: Det har likevel vært en del deltakere fra andre kommuner som har reist inn til Lakselv, både innafor fra Karasjok og utover fra Kvalsund, Hammerfest, Havøysund og Nordkapp.

source: Giellaguovddáš lea maid bargan dan badjelii ahte lágidit kurssiid beaivet (earret ovtta giellakursse mii lágiduvvui muhtun jagiid dás ovdal eahkeskursen Billavuonas).
nob: Språksenteret har også satset på at virksomheten skal foregå på dagtid (unntaket er et språkkurs som for et par år siden ble kjørt i
